keys = ["TIL","1","2","3","4","5","6","7","8","9","0","MIN","EQL","Lq","Lw","Le","Lr","Lt","Ly","Lu","Li","Lo","Lp","LBR","RBR","BSL","La","Ls","Ld","Lf","Lg","Lh","Lj","Lk","Ll","SCO","SQU","Lz","Lx","Lc","Lv","Lb","Ln","Lm","CMA","PRD","FSL","ABT","EXC","ATT","NUM","DOL","PER","CRT","AND","STR","LPR","RPR","USC","PLS","q","w","e","r","t","y","u","i","o","p","LCB","RCB","LNE","a","s","d","f","g","h","j","k","l","COL","QOT","z","x","c","v","b","n","m","LTH","GRT","QUE","SPACE"]

#reversedLe = "¿<>WNᙠΛƆXZ„:˥⋊ſH⅁ℲᗡS∀|{}ԀOI∩⅄⊥ᴚƎMΌ+¯()*⅋ ̮%$#@¡~/˙'ɯuqʌɔxz,؛lʞɾɥɓɟpsɐ\\[]doınʎʇɹǝʍb=-068ㄥ9ގㄣƐᄅ⇂ ̖"

indext = {"Default" : "`1234567890-=qwertyuiop[]\\asdfghjkl;'zxcvbnm,./~!@#$%^&*()_+QWERTYUIOP{}|ASDFGHJKL:\"ZXCVBNM<>? ",
          "Full Width" : "｀１２３４５６７８９０－＝ｑｗｅｒｔｙｕｉｏｐ［］＼ａｓｄｆｇｈｊｋｌ；＇ｚｘｃｖｂｎｍ，．／～！＠＃＄％＾＆＊（）＿＋ｑｗｅｒｔｙｕｉｏｐ｛｝｜ａｓｄｆｇｈｊｋｌ：＂ｚｘｃｖｂｎｍ＜＞？ ",
          "Monospace" : "`𝟷𝟸𝟹𝟺𝟻𝟼𝟽𝟾𝟿𝟶-=𝚚𝚠𝚎𝚛𝚝𝚢𝚞𝚒𝚘𝚙[]\\𝚊𝚜𝚍𝚏𝚐𝚑𝚓𝚔𝚕;'𝚣𝚡𝚌𝚟𝚋𝚗𝚖,./~!@#$%^&*()_+𝚚𝚠𝚎𝚛𝚝𝚢𝚞𝚒𝚘𝚙{}|𝚊𝚜𝚍𝚏𝚐𝚑𝚓𝚔𝚕:\"𝚣𝚡𝚌𝚟𝚋𝚗𝚖<>? ",
          "Spooky" : "`1234567890-=𝔮𝔴𝔢𝔯𝔱𝔶𝔲𝔦𝔬𝔭[]\\𝔞𝔰𝔡𝔣𝔤𝔥𝔧𝔨𝔩;'𝔷𝔵𝔠𝔳𝔟𝔫𝔪,./~!@#$%^&*()_+𝔔𝔚𝔈ℜ𝔗𝔜𝔘ℑ𝔒𝔓{}|𝔄𝔖𝔇𝔉𝔊ℌ𝔍𝔎𝔏:\"ℨ𝔛ℭ𝔙𝔅𝔑𝔐<>? ",
          "Spooky Bold" : "`1234567890-=𝖖𝖜𝖊𝖗𝖙𝖞𝖚𝖎𝖔𝖕[]\\𝖆𝖘𝖉𝖋𝖌𝖍𝖏𝖐𝖑;'𝖟𝖝𝖈𝖛𝖇𝖓𝖒,./~!@#$%^&*()_+𝕼𝖂𝕰𝕽𝕿𝖄𝖀𝕴𝕺𝕻{}|𝕬𝕾𝕯𝕱𝕲𝕳𝕵𝕶𝕷:\"𝖅𝖃𝕮𝖁𝕭𝕹𝕸<>? ",
          "Cursive" : "`𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟪𝟫𝟢-=𝓆𝓌𝑒𝓇𝓉𝓎𝓊𝒾𝑜𝓅[]\\𝒶𝓈𝒹𝒻𝑔𝒽𝒿𝓀𝓁;'𝓏𝓍𝒸𝓋𝒷𝓃𝓂,./~!@#$%^&*()_+𝒬𝒲𝐸𝑅𝒯𝒴𝒰𝐼𝒪𝒫{}|𝒜𝒮𝒟𝐹𝒢𝐻𝒥𝒦𝐿:\"𝒵𝒳𝒞𝒱𝐵𝒩𝑀<>? ",
          "Cursive Bold" : "`1234567890-=𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹[]\\𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵;'𝔃𝔁𝓬𝓿𝓫𝓷𝓶,./~!@#$%^&*()_+𝓠𝓦𝓔𝓡𝓣𝓨𝓤𝓘𝓞𝓟{}|𝓐𝓢𝓓𝓕𝓖𝓗𝓙𝓚𝓛:\"𝓩𝓧𝓒𝓥𝓑𝓝𝓜<>? ",
          "Outlined" : "`𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟠𝟡𝟘-=𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡[]\\𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝;'𝕫𝕩𝕔𝕧𝕓𝕟𝕞,./~!@#$%^&*()_+ℚ𝕎𝔼ℝ𝕋𝕐𝕌𝕀𝕆ℙ{}|𝔸𝕊𝔻𝔽𝔾ℍ𝕁𝕂𝕃:\"ℤ𝕏ℂ𝕍𝔹ℕ𝕄<>? ",
          "Small Caps" : "`1234567890-=Qᴡᴇʀᴛʏᴜɪᴏᴘ[]\\ᴀꜱᴅꜰɢʜᴊᴋʟ;'ᴢxᴄᴠʙɴᴍ,./~!@#$%^&*()_+Qᴡᴇʀᴛʏᴜɪᴏᴘ{}|ᴀꜱᴅꜰɢʜᴊᴋʟ:\"ᴢxᴄᴠʙɴᴍ<>? ",
          "Bold Letters" : "`𝟏𝟐𝟑𝟒𝟓𝟔𝟕𝟖𝟗𝟎-=𝐪𝐰𝐞𝐫𝐭𝐲𝐮𝐢𝐨𝐩[]\\𝐚𝐬𝐝𝐟𝐠𝐡𝐣𝐤𝐥;'𝐳𝐱𝐜𝐯𝐛𝐧𝐦,./~!@#$%^&*()_+𝐐𝐖𝐄𝐑𝐓𝐘𝐔𝐈𝐎𝐏{}|𝐀𝐒𝐃𝐅𝐆𝐇𝐉𝐊𝐋:\"𝐙𝐗𝐂𝐕𝐁𝐍𝐌<>? ",
          "Boxed Letters" : ["`", "1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣", "0️⃣",
                         "🐸-=🅀🅆🄴🅁🅃🅈🅄🄸🄾🄿[]\\🄰🅂🄳🄵🄶🄷🄹🄺🄻;'🅉🅇🄲🅅🄱🄽🄼,./~!@", "#️⃣", "🐸$%^&", "*️⃣",
                         "🐸()_+🅀🅆🄴🅁🅃🅈🅄🄸🄾🄿|{}🄰🅂🄳🄵🄶🄷🄹🄺🄻:\"🅉🅇🄲🅅🄱🄽🄼<>? "],
          "Emoji Box" : ["`", "1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣", "0️⃣", "-",
                         "🐸=🆀🆆🅴🆁🆃🆈🆄🅸🅾🅿[]\\🅰🆂🅳🅵🅶🅷🅹🅺🅻;'🆉🆇🅲🆅🅱🅽🅼,./~!@", "#️⃣", "🐸$%^&", "*️⃣",
                         "(", ")", "_", "+", "🐸🆀🆆🅴🆁🆃🆈🆄🅸🅾🅿|{}🅰🆂🅳🅵🅶🅷🅹🅺🅻:\"🆉🆇🅲🆅🅱🅽🅼<>? "],
          "Regional Indicators - With Spaces" : ["`", "1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣", "0️⃣",
                         "➖", "=", "🇶 ", "🇼 ", "🇪 ", "🇷 ", "🇹 ", "🇾 ", "🇺 ", "🇮 ", "🇴 ", "🇵 ",
                         "[", "]", "\\", "🇦 ", "🇸 ", "🇩 ", "🇫 ", "🇬 ", "🇭 ", "🇯 ", "🇰 ", "🇱 ", ";",
                         "'", "🇿 ", "🇽 ", "🇨 ", "🇻 ", "🇧 ", "🇳 ", "🇲 ", "🐸,./~", "❗", "@", "#️⃣", "💲", "%", "^", "&", "*️⃣",
                         "🐸()_", "➕", "🇶 ", "🇼 ", "🇪 ", "🇷 ", "🇹 ", "🇾 ", "🇺 ", "🇮 ", "🇴 ", "🇵 ",
                         "|", "{", "}", "🇦 ", "🇸 ", "🇩 ", "🇫 ", "🇬 ", "🇭 ", "🇯 ", "🇰 ", "🇱 ",
                         ":", "\"", "🇿 ", "🇽 ", "🇨 ", "🇻 ", "🇧 ", "🇳 ", "🇲 ", "<", ">", "❓", " "],
          "Regional Indicators - Flag Mode" : ["`", "1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣", "0️⃣", "➖",
                         "🐸=🇶🇼🇪🇷🇹🇾🇺🇮🇴🇵[]\\🇦🇸🇩🇫🇬🇭🇯🇰🇱;'🇿🇽🇨🇻🇧🇳🇲,./~", "❗", "@", "#️⃣", "💲", "%", "^", "&", "*️⃣",
                         "(", ")", "_", "➕", "🐸🇶🇼🇪🇷🇹🇾🇺🇮🇴🇵|{}🇦🇸🇩🇫🇬🇭🇯🇰🇱:\"🇿🇽🇨🇻🇧🇳🇲<>", "❓", " "],
          "Circles" : "`①②③④⑤⑥⑦⑧⑨⓪⊖⊜ⓠⓦⓔⓡⓣⓨⓤⓘⓞⓟ[]\\ⓐⓢⓓⓕⓖⓗⓙⓚⓛ;'ⓩⓧⓒⓥⓑⓝⓜ,⨀/~!@#$%^&⊛()_⊕ⓆⓌⒺⓇⓉⓎⓊⒾⓄⓅ⦶{}ⒶⓈⒹⒻⒼⒽⒿⓀⓁ:\"ⓏⓍⒸⓋⒷⓃⓂ⧀⧁? ",
          "Dark Circles" : "`❶❷❸❹❺❻❼❽❾⓿-=🅠🅦🅔🅡🅣🅨🅤🅘🅞🅟[]\\🅐🅢🅓🅕🅖🅗🅙🅚🅛;'🅩🅧🅒🅥🅑🅝🅜,./~!@#$%^&*()_+🅠🅦🅔🅡🅣🅨🅤🅘🅞🅟|{}🅐🅢🅓🅕🅖🅗🅙🅚🅛:\"🅩🅧🅒🅥🅑🅝🅜<>? ",
          "Wingdings" : "♊📂📄🗏🗐🗄⌛🖮🖰🖲📁📫🖬❑⬥♏❒⧫⍓◆♓□◻☯☸ॐ♋⬧♎♐♑♒🙰🙵●🖴🕯⌘⌧♍❖♌■❍📪📬📭❞✏@✁👓🕭♈🕮🖂🕿✆♉🖃✈🕈☜☼❄✡🕆✋⚐🏱❀❝✿✌💧👎☞☝☟☺😐☹🖳✂☪✠👍✞👌☠💣🖫✇✍ ",
          "Japanese" : "`1234567890-=Ɋ山乇尺ㄒㄚㄩ丨ㄖ卩[]\\卂丂ᗪ千Ꮆ卄ﾌҜㄥ;'乙乂匚ᐯ乃几爪,./~!@#$%^&*()_+Ɋ山乇尺ㄒㄚㄩ丨{}ㄖ卩|卂丂ᗪ千Ꮆ卄ﾌҜㄥ:\"乙乂匚ᐯ乃几爪<>? ",
          "Greek" : "`1234567890-=qωєятуυισρ[]\\αѕ∂ƒgнנкℓ;'zχ¢νвηм,./~!@#$%^&*()_+QЩΣЯƬYЦIӨP|{}ΛƧDFGΉJKᄂ:\"ZXᄃVBПM<>? ",
          "Russian" : "`12З456789Ѳ-=фшеятуціор[]\\ѧsэӻgнлкг;'zхсѵвпм,./~!@#$%^&*()_+ФШЕЯТУЦІОР{}|ѦSЭӺGНЛКГ:\"ZХСѴВПМ<>? ",
          "Egyptian" : "𓆩𓃉𓃊𓃋𓃌𓃍𓃎𓃏𓃐𓃑𓀡𓐄𓐅𓃂𓁐𓆇𓆊𓆛𓇳𓊛𓁹𓅓𓆰𓉘𓉝𓄢𓋱𓆙𓅷𓆐𓀫𓁶𓃥𓀵𓄙𓏪𓏰𓀿𓀏𓃠𓀄𓂑𓂉𓀒𓏹𓏳𓄧𓈗𓍡@𓆷𓇨𓇻𓐑𓎓𓇼𓊆𓊇𓇿𓏶𓃇𓁑𓂫𓆋𓆉𓇵𓊝𓂀𓅔𓇆𓐮𓐨𓉽𓋯𓆚𓅬𓆏𓀬𓁷𓃦𓀶𓂾𓇡𓏭𓁀𓀑𓃬𓀅𓂒𓂊𓀐𓂽𓂻𓏲 ",
          "Tiny Upper" : "`¹²³⁴⁵⁶⁷⁸⁹⁰⁻⁼qʷᵉʳᵗʸᵘⁱᵒᵖ[]\\ᵃˢᵈᶠᵍʰʲᵏˡ;'ᶻˣᶜᵛᵇⁿᵐ,./~!@#$%^&*⁽⁾_⁺Qᵂᴱᴿᵀʸᵁᴵᴼᴾ|{}ᴬˢᴰᶠᴳᴴᴶᴷᴸ:\"ᶻˣᶜⱽᴮᴺᴹ<>? ",
          "Lookalikes" : "`1234567890-=qwêr†¥µïðþ[]\\å§Ð£ghjkl;'zx¢vßñm,./~!@#$%^&*()_+QWÈR†¥ÚÌÖþ|{}Ä§Ð£GHJKL:\"Z×ÇVßñM<>? ",
          "Strikethrough" : "`1234567890-=Q₩ɆⱤ₮ɎɄłØ₱[]\\₳₴Đ₣₲ⱧJ₭Ⱡ;'ⱫӾ₵V฿₦₥,./~!@#$%^&*()_+Q₩ɆⱤ₮ɎɄłØ₱|{}₳₴Đ₣₲ⱧJ₭Ⱡ:\"ⱫӾ₵V฿₦₥<>? ",
          "Mirrored" : " ⸮<>MͶᙠVƆXƸ\":⅃⋊ႱHᎮꟻᗡꙄAl{}ꟼOIUYTЯƎWỌ+_()*&^%$#@!~\\.,mᴎdvɔxƹ';|ʞꞁʜǫᎸbꙅɒ/[]qoiuʏƚɿɘwp=-0987654321´"[::-1],
          "Upside Down" : [" ¿<>WNᙠΛƆXZ„:˥⋊ſH⅁ℲᗡS∀|{}ԀOI∩⅄⊥ᴚƎMΌ+¯()*⅋🐸"[::-1], " ̮", "%$#@¡~/˙'ɯuqʌɔxz,؛lʞɾɥɓɟpsɐ\\[]doınʎʇɹǝʍb=-068ㄥ9ގㄣƐᄅ⇂🐸"[::-1], " ̖"][::-1]}



def clean(val, arrayorstring):
    if len(arrayorstring) == len(keys):
        return arrayorstring
    else:
        nar = []
        for v in arrayorstring:
            if v[0] == "🐸":
                for let in v:
                    if let != "🐸":
                        nar.append(let)
            else:
                nar.append(v)

        return nar


for x in indext:
    indext[x] = clean(x, indext[x])


print(len(keys))

titles = []
for x in indext:
    titles.append(x)

with open('db.🐸sv', 'w', encoding="utf8") as fp:
    fp.write('\ufeff')
    fp.write(','.join(titles))
    fp.write('\n')
    for element in range(0, len(keys)):
        vals = []
        vals.append(keys[element])
        for x in indext:
            if len(indext[x]) == len(keys):
                vals.append(indext[x][element])
            else:
                print(indext[x])
                print("Skipping: " + x)

        valstr = "🐸".join(vals)
        fp.write(valstr + '\n')
